2026_06.md

# Table of Contents

1.  [2026-06-12](#org563eb98)
2.  [2026-06-13](#org0c4cffd)
3.  [2026-06-14](#org5810c4e)
    1.  [麦茶システムとは](#orgbcba0e1)
    2.  [日報自動更新の修正](#org4aad2e1)
    3.  [magitの使い方をいろいろ調べた](#org1546113)
4.  [2026-06-15](#orge723ef6)
    1.  [追記](#org2479437)
5.  [2026-06-16](#orgd4333f7)
6.  [2026-06-17](#org2d95340)
7.  [2026-06-18](#org9694be1)
8.  [2026-06-19](#org789a7ac)
    1.  [梅酒｡始めました｡](#org092dae5)
        1.  [梅酒飲んでみる](#orgc0bc441)



<a id="org563eb98"></a>

# 2026-06-12

3か月ほどDoom emacsを使ってみて､なんとなく馴染んできたので本格的にvimから移行するためにinit.elを書き始めました｡
なんやかんやAIとか使ってみたら､org-modeを使った日報管理の仕組みまで1日で作ることができたので､こちらも今日から使ってみます｡


<a id="org0c4cffd"></a>

# 2026-06-13

GJGJでアマギフ50000円をもらったけど何に使えばよいか決めかねている(半月くらい考えている)
米を買いたいけどアマゾンだとちょっと高いし､せっかくゲームジャムで貰った賞金なら技術書とかが良いかなと思うけど､
でも､やっぱり米が安定かなと思うけど割高(半月くらい考えている)

とりま､折角ゲームジャムに参加したということで <del>金も貰ったし!</del> ､Over the oneの技術記事を書き始めました｡
ひとまずシェーダー関係とMultiMesh3Dと､リングバッファについては書きたい感じ｡
AI時代とはいえ､ここらへんの知識は色々役にたつのではないかという気がします｡


<a id="org5810c4e"></a>

# 2026-06-14

本日より麦茶システム2026を起動しました


<a id="orgbcba0e1"></a>

## 麦茶システムとは

夏場に毎日大量の麦茶を作って大量に飲むシステム


<a id="org4aad2e1"></a>

## 日報自動更新の修正

-   TODOをorg-agendaに反映できるようにした


<a id="org1546113"></a>

## magitの使い方をいろいろ調べた

そもそもvimからemacsの移行を決めたきっかけとして､vimを使う速さが衰えてきたというのがあります｡
もう動体視力が追いつかないので自分で動かしたカーソルが追えません(そのくらいvimのカーソルは慣れると速く動く)し､
最近は昨日の自分はおろか､1秒前の自分すら完全に別人というくらいの記憶力なので､
5分前のコミット内容はもちろんのこと､grepのコマンドを打った瞬間になにを検索するのか忘れる始末｡
個人開発｡今まではgitのコミットメッセージに｢commit｣と書いても､それを読む自分が作業内容やコードを忘れることはなかったし､
忘れる前に書き終える体力もありましたが､もう別人に向けて書かないといけないくらいヤキが回ってきました｡
そこでmagitの使い勝手がとても便利だったり､メモやTODOについてもより詳細に書く必要からorg-modeを使い始めた感じ｡
そもそも新しいことが面白かったり､昨今はAI使えばある程度すぐに使える設定が書けたりするのも大きいなぁと思います｡


<a id="orge723ef6"></a>

# 2026-06-15


<a id="org2479437"></a>

## 追記

<https://github.com/godotengine/emacs-gdscript-mode>
ココ読んだらgdscript-modeは正規表現エンジンだけど､gdscript-ts-modeというのもパッケージに入ってるぽい｡
というか色々有難いことが書いてありましたので今度試したいと思います｡


<a id="orgd4333f7"></a>

# 2026-06-16

emacsのinit.elをinit.orgに書き換え｡これがやりたかった｡
あと､gdscriptのtreesitterパーサやらtextobject用のクエリの設定をして,
とりあえずfunction, indent, argumentは対応できたぽい｡
コメントブロックについても設定したいのだけれど､これはパーサが対応してない気がするのでちょっと難しいのかもしれないです｡
というか､ココ数日環境ばっかいじってて､肝心のゲーム制作が進まず｡いつもこんな感じではありますが｡
週末に向けてまた進めていきたい所存にございます｡

私自身に食べ物の好き嫌いというのは全く無く､マジで｢ネジはギリ可食｣くらい何でも食べられると思っています｡
が､たとえば｢ピーマンが嫌い｣という人の言い分はわかる｡苦いから｡にんじん､しいたけ､ウニなんかも分かります｡
ただ､｢レーズンが嫌い｣というのはギリギリ何が嫌なのかがよくわからないので､
今後レーズン嫌いな人に会う機会があれば是非理由を聞いてみたい感じ｡普通に甘くて美味しいくね?

昔､うまい棒のバリエーションで｢うまい輪｣というのがあった気がするけど気のせい?


<a id="org2d95340"></a>

# 2026-06-17

今日は仕事が忙しかった｡明日も忙しい｡というか暑い｡
FunctionSUEの標準ボタンの修正｡
FunctionSUEが全くもって終わらない話はログ書く余裕もないので､完成したら是非誰かに聞いて欲しい｡
あとは今月中にGJGJの振り返り記事を仕上げたいところです｡
あ､emacs-lispの勉強も少し始めてみました｡とりあえず異常なボリュームのtutorialにビビりました｡
<https://www.math.s.chiba-u.ac.jp/~matsu/lisp/emacs-lisp-intro-jp.html>


<a id="org9694be1"></a>

# 2026-06-18

毎年開催ぬか床チャレンジ2026開始｡2024, 2025は冷蔵庫で作るタイプのものだったが､
今年はぬか床用のバケツみたいなので常温で作る方針｡目標としては来年の夏まで維持したいのだけれど､これがなかなか難しい｡
今年は梅酒も作ってみたいんだよなー｡時期的にはそろそろラストチャンスのタイミングなので､梅を見つけ次第買ってみるつもり｡
FunctionSUEの進捗が久々にそこそこ進んだ｡仕事忙しい方がなんか進捗良い傾向がある気がする｡短い時間に集中して作業するのが効果的なのかも｡もしかしたらEmacsで作った環境の効果かもしれません｡それなら嬉しいのだけれど､どうだろうね｡


<a id="org789a7ac"></a>

# 2026-06-19


<a id="org092dae5"></a>

## 梅酒｡始めました｡

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">材料</th>
<th scope="col" class="org-right">コスト</th>
<th scope="col" class="org-left">備考</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">梅</td>
<td class="org-right">1500</td>
<td class="org-left">南高梅は2000円だった</td>
</tr>

<tr>
<td class="org-left">焼酎</td>
<td class="org-right">1500</td>
<td class="org-left">専用の日本酒でもうまいらしい</td>
</tr>

<tr>
<td class="org-left">氷砂糖</td>
<td class="org-right">500</td>
<td class="org-left">特になし</td>
</tr>

<tr>
<td class="org-left">瓶</td>
<td class="org-right">1000</td>
<td class="org-left">4L</td>
</tr>
</tbody>
</table>

酒税法か何かで､20%未満の度数のアルコールで果実酒を作るのが違法であるということを初めて知りました｡
20%未満だと発酵する可能性があり､それは醸造になってしまうというのが理由らしい｡へぇーへぇー｡
また､ぶどう及び山ぶどうは酒に漬ける事自体がワイン醸造となるのでダメとか｡なかなか学びがあります｡

作業自体は若干面倒ではあるものの､やってみれば単純であっという間｡そしてこれが半年後にどうなっているかはもちろん未定｡雑菌繁殖エンドの可能性は低くありません｡コスト的にも普通に梅酒買うのの倍は軽くかかりました｡
｢自分が作った梅酒で梅割りを飲むために1年待つ｣みたいな感覚､私は好きですが､コスパやらタイパやらがすっかり定着した現代､こういう文化もなかなか伝わらないのかもなぁと感じました｡ぬか漬けなんかもそうですけど｡


<a id="orgc0bc441"></a>

### TODO 梅酒飲んでみる

とか､org-modeの機能を使って書いてみるテスト｡

